//------------------------------------------------------------------------------
// rectangle.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void Rectangle::In(ifstream &ifst) {
    ifst >> x >> y;
}

// Случайный ввод параметров прямоугольника
void Rectangle::InRnd() {
    x = Shape::rnd20.Get();
    y = Shape::rnd20.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Rectangle::Out(ofstream &ofst) {
    ofst << "It is Rectangle: x = " << x << ", y = " << y 
         << ". Perimeter = " << Perimeter() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Rectangle::Perimeter() {
    return 2.0 * (x + y);
}
