//------------------------------------------------------------------------------
// paral.cpp - содержит методы параллелипипеда
//------------------------------------------------------------------------------

#include "paral.h"

//------------------------------------------------------------------------------
// Ввод параметров параллелипипеда из файла
void Paral::In(ifstream &ifst) {
    ifst >> dens >> x >> y >> z;
	vol = Volume();
}

// Случайный ввод параметров параллелипипеда
void Paral::InRnd() {
    x = Shape::rnd100.Get();
    y = Shape::rnd100.Get();
	z = Shape::rnd100.Get();
	dens = Shape::rnd100.Get() + (1.0 * Shape::rnd100.Get() / 100);
}

//------------------------------------------------------------------------------
// Вывод параметров параллелипипеда в форматируемый поток
void Paral::Out(ofstream &ofst) {
    ofst << "It is Parallelepiped: x = " << x << ", y = " << y << ", z = " << z
         << ". Volume = " << vol << ", Density = " << dens << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объема параллелипипеда
double Paral::Volume() {
    return x * y * z;
}
