//------------------------------------------------------------------------------
// sphere.cpp - содержит функции обработки сферы
//------------------------------------------------------------------------------

#include "sphere.h"
#include<cmath>
using namespace std;


//------------------------------------------------------------------------------
// Ввод параметров сферы из потока
void Sphere::In(ifstream &ifst) {
    ifst >> dens >> radius;
	vol = Volume();
}

// Случайный ввод параметров сферы
void Sphere::InRnd() {
    radius = Shape::rnd100.Get();
	dens = Shape::rnd100.Get() + (1.0 * Shape::rnd100.Get() / 100);
}

//------------------------------------------------------------------------------
// Вывод параметров сферы в поток
void Sphere::Out(ofstream &ofst) {
    ofst << "It is Sphere: radius = " << radius
         << ". Volume = " << vol << ", Density = " << dens << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объема сферы
double Sphere::Volume() {
    return 4 * 3.14 * pow(radius,3) / 3;
}
