//------------------------------------------------------------------------------
// tetra.cpp - содержит функции обработки тетраэдра
//------------------------------------------------------------------------------

#include "tetra.h"
#include<cmath>
using namespace std;

//------------------------------------------------------------------------------
// Ввод параметров тетраэдра из потока
void Tetra::In(ifstream &ifst) {
    ifst >> dens >> a;
	vol = Volume();
}

// Случайный ввод параметров тетраэдра
void Tetra::InRnd() {
    a = Shape::rnd100.Get();
	dens = Shape::rnd100.Get() + (1.0 * Shape::rnd100.Get() / 100);
}

//------------------------------------------------------------------------------
// Вывод параметров тетраэдра в поток
void Tetra::Out(ofstream &ofst) {
    ofst << "It is Regular Tetrahedron: a = " << a
         << ". Volume = " << vol << ", Density = " << dens << "\n";
}

//------------------------------------------------------------------------------
// Вычисление объема тетраэдра
double Tetra::Volume() {
    return pow(2,0.5) * pow(a,3) / 12;
}
