//------------------------------------------------------------------------------
// shape_Out.cpp - содержит процедуру вывода параметров 
// для любой геометрической фигуры
//------------------------------------------------------------------------------

#include <iostream>
#include "shape_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.

//------------------------------------------------------------------------------

  // Вывод параметров текущей фигуры в стандартный поток вывода
  void Out(shape &s)
  {
    switch(s.k) {
	case RECTANGLE:
		// Out(s.r);
		cout << "It is Rectangle: x = " << s.r.x << ", y = " << s.r.y << endl;
		break;
    case TRIANGLE:
		// Out(s.t);
		cout << "It is Triangle: a = " 
			<< s.t.a << ", b = " << s.t.b
			<< ", c = " << s.t.c << endl;
		break;
    default:
      cout << "Incorrect figure!" << endl;
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
